![png](movieERD.png)

In [1]:
import pandas as pd
import pymysql
pymysql.install_as_MySQLdb()

In [2]:
import json
with open('/Users/marcolaureano2/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [3]:
from sqlalchemy import create_engine

In [5]:
# Create the sqlalchemy engine and connection
connection = f"mysql+pymysql://{login['username']}:{(login['password'])}@localhost/movie_database"
engine = create_engine(connection)
conn = engine.connect()

In [7]:
q =  """SHOW TABLES;"""
pd.read_sql(q, conn)

  Tables_in_movie_database
0                   genres
1                  ratings
2             title_basics
3             title_genres

In [10]:
q = """ DESC genres"""
pd.read_sql(q, conn)

        Field          Type Null  Key Default Extra
0    genre_id           int   NO  PRI    None
1  genre_name  varchar(255)  YES         None

In [11]:
q = """ DESC ratings"""
pd.read_sql(q, conn)

             Field          Type Null  Key Default Extra
0           tconst  varchar(255)   NO  PRI    None
1   average_rating           int  YES         None
2  number_of_votes           int  YES         None

In [14]:
q = """ DESC title_basics

"""
pd.read_sql(q, conn)

           Field          Type Null  Key Default Extra
0         tconst  varchar(255)   NO  PRI    None
1  primary_title  varchar(255)  YES         None
2     start_year           int  YES         None
3        runtime           int  YES         None

In [15]:
q = """ DESC title_genres

"""
pd.read_sql(q, conn)

      Field          Type Null Key Default Extra
0    tconst  varchar(255)  YES        None
1  genre_id           int   NO        None

In [17]:
title_basics = pd.read_csv('/Users/marcolaureano2/Documents/GitHub/Movie-Database/Data/preprocessed_movie_data.csv')

,Unnamed: 0,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,34802,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,61114,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,67666,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,81515,tt0083324,movie,The White Lions,The White Lions,0,NaN,NaN,97,Drama
4,86793,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
...,...,...,...,...,...,...,...,...,...,...
84543,10016225,tt9915130,movie,Meet John Doe,Meet John Doe,0,NaN,NaN,120,NaN
84544,10016544,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019.0,NaN,97,"Comedy,Drama,Fantasy"
84545,10016684,tt9916170,movie,The Rehearsal,O Ensaio,0,2019.0,NaN,51,Drama
84546,10016693,tt9916190,movie,Safeguard,Safeguard,0,2020.0,NaN,95,"Action,Adventure,Thriller"
84547,10016777,tt9916362,movie,Coven,Akelarre,0,2020.0,NaN,92,"Drama,History"

In [ ]:
title_basics = title_basics.drop(['titleType', 'originalTitle', 'isAdult', 'endYear', 'genres'], axis=1)

In [30]:
title_basics

,Unnamed: 0,tconst,primaryTitle,startYear,runtimeMinutes
0,34802,tt0035423,Kate & Leopold,2001.0,118
1,61114,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,67666,tt0069049,The Other Side of the Wind,2018.0,122
3,81515,tt0083324,The White Lions,NaN,97
4,86793,tt0088751,The Naked Monster,2005.0,100
...,...,...,...,...,...
84543,10016225,tt9915130,Meet John Doe,NaN,120
84544,10016544,tt9915872,The Last White Witch,2019.0,97
84545,10016684,tt9916170,The Rehearsal,2019.0,51
84546,10016693,tt9916190,Safeguard,2020.0,95
84547,10016777,tt9916362,Coven,2020.0,92

In [36]:
title_basics = title_basics.drop('Unnamed: 0', axis=1)

In [38]:
rename_title = {'primaryTitle':'primary_title', 'startYear':'start_year', 'runtimeMinutes':'runtime'}
title_basics = title_basics.rename(rename_title, axis=1)
title_basics.head()

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0083324,The White Lions,NaN,97
4,tt0088751,The Naked Monster,2005.0,100

In [39]:
title_basics.to_sql('title_basics', conn, index=False, if_exists='append')

84548

In [19]:
ratings = pd.read_csv('/Users/marcolaureano2/Documents/GitHub/Movie-Database/Data/filtered_ratings.csv')
ratings

       Unnamed: 0     tconst  averageRating  numVotes
0           17961  tt0035423            6.4     87153
1           40764  tt0062336            6.4       175
2           46645  tt0069049            6.7      7754
3           63640  tt0088751            5.2       336
4           69953  tt0096056            5.6       846
...           ...        ...            ...       ...
67164     1331411  tt9914942            6.6       178
67165     1331437  tt9915872            6.4         9
67166     1331450  tt9916170            7.0         7
67167     1331451  tt9916190            3.7       243
67168     1331462  tt9916362            6.4      5422

[67169 rows x 4 columns]

In [41]:
ratings = ratings.drop('Unnamed: 0', axis = 1)

In [42]:
rename_ratings = {'averageRating':'average_rating', 'numVotes':'number_of_votes'}
ratings = ratings.rename(rename_ratings, axis=1)
ratings.head()

      tconst  average_rating  number_of_votes
0  tt0035423             6.4            87153
1  tt0062336             6.4              175
2  tt0069049             6.7             7754
3  tt0088751             5.2              336
4  tt0096056             5.6              846

In [43]:
ratings.to_sql('ratings', conn, index=False, if_exists='append')

67169

In [44]:
q = """SHOW tables

"""""
pd.read_sql(q, conn)

  Tables_in_movie_database
0                   genres
1                  ratings
2             title_basics
3             title_genres

In [46]:
q = """ DESCRIBE genres

"""""
pd.read_sql(q, conn)

        Field          Type Null  Key Default Extra
0    genre_id           int   NO  PRI    None
1  genre_name  varchar(255)  YES         None

In [48]:
q = """ DESCRIBE ratings

"""""
pd.read_sql(q, conn)

             Field          Type Null  Key Default Extra
0           tconst  varchar(255)   NO  PRI    None
1   average_rating           int  YES         None
2  number_of_votes           int  YES         None

In [49]:
q = """ DESCRIBE title_basics

"""""
pd.read_sql(q, conn)

           Field          Type Null  Key Default Extra
0         tconst  varchar(255)   NO  PRI    None
1  primary_title  varchar(255)  YES         None
2     start_year           int  YES         None
3        runtime           int  YES         None

In [50]:
q = """ DESCRIBE title_genres

"""""
pd.read_sql(q, conn)

      Field          Type Null Key Default Extra
0    tconst  varchar(255)  YES        None
1  genre_id           int   NO        None

In [53]:
q = """ SELECT tconst, average_rating
FROM ratings
WHERE average_rating > 6
LIMIT 5

"""""
pd.read_sql(q, conn)

      tconst  average_rating
0  tt0069049               7
1  tt0108549               8
2  tt0116991               7
3  tt0117743               7
4  tt0118926               7